templates/NotifyRequest.xml

<?xml version="1.0" encoding="utf-8"?><env:Envelope xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:tns1="http://www.onvif.org/ver10/topics" xmlns:tt="http://www.onvif.org/ver10/schema"><env:Header><wsa:Action>http://docs.oasis-open.org/wsn/bw-2/NotificationConsumer/Notify</wsa:Action></env:Header><env:Body><wsnt:Notify><wsnt:NotificationMessage><wsnt:SubscriptionReference><wsa:Address>http://{{data.notify_addr}}</wsa:Address></wsnt:SubscriptionReference><wsnt:Topic Dialect="http://www.onvif.org/ver10/tev/topicExpression/ConcreteSet">tns1:/Device/Introscopy/LimitExceeded</wsnt:Topic><wsnt:ProducerReference><wsa:Address>http://{{data.self_addr}}/onvif/event_services/</wsa:Address></wsnt:ProducerReference><wsnt:Message><tt:Message UtcTime="{{data.time}}" PropertyOperation="Initialized"><tt:Source><tt:SimpleItem Name="Id" Value="{{data.id}}"/></tt:Source><tt:Key/><tt:Data><tt:SimpleItem Name="Account" Value="0000"/><tt:SimpleItem Name="Result" Value="None"/><tt:SimpleItem Name="Picture" Value="{{data.image}}"/></tt:Data></tt:Message></wsnt:Message></wsnt:NotificationMessage> </wsnt:Notify></env:Body></env:Envelope>

